#include <iostream> 
int main() {
    int n = 10;
    int m = 5;
    // 1) n++ * m
    int n1 = 10;
    int m1 = 5;
    std::cout << "1) " << n1++ * m1 << " (n теперь: " << n1 << ")" << std::endl;
    // 2) n++<m
    int n2 = 10;
    int m2 = 5;
    std:: cout << "2) "<< (n2++ < m2) << " (n теперь: " << n2 << ")" << std::endl;
    //3) m-- > m
    int m3 = 5;
    std:: cout << "3) " << (m3-- > m3)<< " (m теперь: " << m3 <<")"<< std::endl;
    return 0;
}
//вводные данные: n=10,m=5
/*Результаты:
1. n++*m = 50 (стало n = 11)
1.1 Оператор ++ после переменной имеет высокий приоритет, но его свойство заключается в том, что он возвращает старое значение, а саму переменную увеличивает уже после того, как это значение было использовано в выражении.
По шагам:
	1. Берётся текущее значение n1 (10).
	2. Умножается на m1 (5). Получаем 10*5=50. Это значение выводится на экран.
	3. Сразу после этого n1 увеличивается на 1 и становится 11.
2. n++<m = 0 (стало n = 11)
2.1Постфиксный инкремент сначала отдаёт старое значение для сравнения.
По шагам:
	1. Для сравнения берётся старое n2 (оно равно 10).
	2. Происходит сравнение: 10 < 5. Это ложь, поэтому результат операции равен 0 (false).
	3. После этого n2 увеличивается и становится 11.

3. m-->m = 1 (стало m = 4)

В C++ выражение (m3-- > m3) приводит к так называемому Undefined Behavior (неопределённому поведению).
Согласно стандарту C++, компилятор не обязан вычислять левую и правую части оператора сравнения > в каком-то 
строго определённом порядке. Он может сначала взять значение справа, а потом слева, или наоборот. 
Более того, изменение переменной (m3--) и её чтение в одной и той же строчке без чётких «точек останова»  
заставляет разные компиляторы выдавать разные результаты.
компилятор (g++):  он сначала уменьшил m3, а потом подставил значения, либо выполнил это в таком порядке, 
что результат операции > вернул 1 (true) или 0 (false). 


